app/views/blogs/show.html.erb


<% @blog.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 2