app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("blog_id", "content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["blog_id", nil], ["content", "Yummy!"], ["created_at", Wed, 05 Sep 2012 00:08:07 UTC +00:00], ["name", "Divya"], ["updated_at", Wed, 05 Sep 2012 00:08:07 UTC +00:00]]