app/controllers/locations_controller.rb

SELECT locations.*, (69.09332411348201 * ABS(locations.latitude - -15.8322558) * 0.7071067811865475) + (59.836573914187355 * ABS(locations.longitude - -70.030791) * 0.7071067811865475) AS distance, CASE WHEN (latitude >= -15.8322558 AND longitude >= -70.030791) THEN 45.0 WHEN (latitude < -15.8322558 AND longitude >= -70.030791) THEN 135.0 WHEN (latitude < -15.8322558 AND longitude < -70.030791) THEN 225.0 WHEN (latitude >= -15.8322558 AND longitude < -70.030791) THEN 315.0 END AS bearing FROM "locations" WHERE (latitude BETWEEN -17.27957363110848 AND -14.38493796889152 AND longitude BETWEEN -71.53517843728717 AND -68.52640356271282) ORDER BY distance
---
def index
  if params[:search].present?
    @locations = Location.near(params[:search],100)
    @json = @locations.to_gmaps4rails
  else
    @locations = Location.all

INSERT INTO "locations" ("city", "created_at", "gmaps", "latitude", "longitude", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "items" ("created_at", "image", "item_name", "location_id", "store_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save
                @item = Item.new(params[:item])
        @item.location_id = @location.id
        @item.save