app/views/locations/_item_box.html.erb

SELECT "items".* FROM "items" WHERE "items"."location_id" = 1
---
<div class="container1">
	<% location.items.each do |i|%>